Revit 2024 API
DirectShape.HasExternalGeometry Method
 Checks whether the externally tagged geometry is already present in this DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool HasExternalGeometry(
	ExternalGeometryId externalId
)
Visual Basic
Public Function HasExternalGeometry ( _
	externalId As ExternalGeometryId _
) As Boolean
Visual C++
public:
bool HasExternalGeometry(
	ExternalGeometryId^ externalId
)
Parameters
externalId
Type: Autodesk.Revit.DB.ExternalGeometryId
 The external ID of the externally tagged geometry to check.
Return Value
 True if such an externally tagged geometry is already present in this DirectShape, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DirectShape Class
Autodesk.Revit.DB Namespace